# FabricationPartCannotChangeTypeBadDimUnConnError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationPartCannotChangeTypeBadDimUnConnError Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions, resulting in bad geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationPartCannotChangeTypeBadDimUnConnError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartCannotChangeTypeBadDimUnConnError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeBadDimUnConnError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace